/**
 * @file YOG2 RAL配置
 * @author fis@baidu.com
 *
 * RAL是一个后端资源统一请求层，最常见的场景是封装HTTP请求
 *
 * 它的特色在于实现了请求协议与数据打包协议的解耦，并且提供了负载均衡与超时、异常重试机制。
 *
 * 更多的文档可以参考 https://github.com/fex-team/node-ral
 */

/* global yog */

module.exports.ral = {
    /**
     **************************************************************************
     *
     * 配置目录
     *
     *
     * RAL会自动加载配置目录中的所有配置
     *
     ***************************************************************************/

    confDir: yog.ROOT_PATH + '/conf/ral',

    /**
     **************************************************************************
     *
     * Log配置
     *
     *
     * RAL使用yog-log进行日志处理，默认我们直接使用log的配置即可
     *
     ***************************************************************************/

    logger: require('./log').log
};
